Results/OpenFoam-rhoCentralFoam-100x100/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
  1.4
1.4
1.4
1.4
1.4
1.4
1.4
1.4
...
);

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 1.4;
    }

    right
    {
        type            fixedValue;
        value           uniform 1.12;
    }

    
    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    empty
    {
        type            empty;
    }
}
// ************************************************************************* //
