Results/OpenFoam-rhoCentralFoam-100x100/0/V
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      V;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
8e-06
8e-06
8e-06
8e-06
8e-06
8e-06
8e-06
8e-06
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.0004
0.0004
0.0004
0.0004
0.0004
0.0004
0.0004
0.0004
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.0004
0.0004
0.0004
0.0004
0.0004
0.0004
0.0004
0.0004
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.004
0.004
0.004
0.004
0.004
0.004
0.004
0.004
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.004
0.004
0.004
0.004
0.004
0.004
0.004
0.004
...
)
;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
