Results/OpenFoam-rhoCentralFoam-100x100/0/ccx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
-0.99
-0.97
-0.95
-0.93
-0.91
-0.89
-0.87
-0.85
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-1
-1
-1
-1
-1
-1
-1
-1
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
1
1
1
1
1
1
1
1
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-0.99
-0.97
-0.95
-0.93
-0.91
-0.89
-0.87
-0.85
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-0.99
-0.97
-0.95
-0.93
-0.91
-0.89
-0.87
-0.85
...
)
;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
