Results/OpenFoam-rhoCentralFoam-100x100/0/ccy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ccy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
-0.099
-0.099
-0.099
-0.099
-0.099
-0.099
-0.099
-0.099
...
)
;

boundaryField
{
    left
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-0.099
-0.097
-0.095
-0.093
-0.091
-0.089
-0.087
-0.085
...
)
;
    }
    right
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-0.099
-0.097
-0.095
-0.093
-0.091
-0.089
-0.087
-0.085
...
)
;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.1
0.1
0.1
0.1
0.1
0.1
0.1
0.1
...
)
;
    }
    bottom
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-0.1
-0.1
-0.1
-0.1
-0.1
-0.1
-0.1
-0.1
...
)
;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
