Results/OpenFoam-rhoCentralFoam-100x100/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
1
1
1
1
1
1
1
1
...
0.1

);

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 1;
    }

    right
    {
        type            fixedValue;
        value           uniform 0.1;
    }


    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
