Results/OpenFoam-rhoCentralFoam-100x100/0/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.1";
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   nonuniform List<scalar> 
10000
(
1
1
1
1
1
1
1
1
...
0.125

)
;

boundaryField
{
    left
    {
        type            calculated;
        value           uniform 1;
    }
    right
    {
        type            calculated;
        value           uniform 0.125;
    }


    top
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }
    
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
